.emacs.d/init.org
** Dashboard
An essential. 
#+BEGIN_SRC emacs-lisp
(use-package dashboard
  :config (dashboard-setup-startup-hook))
#+END_SRC
Some config
#+BEGIN_SRC emacs-lisp
  (setq initial-buffer-choice (get-buffer "*dashboard*"))
  ;;(setq dashboard-startup-banner 1)
  (setq dashboard-center-content t)
  (setq dashboard-show-shortcuts nil)
  (setq dashboard-set-init-info nil)
  (setq dashboard-set-footer nil)

  (setq dashboard-items '((recents  . 5)
                          (projects . 5)
                          (agenda . 5)))

  (setq dashboard-item-names '(("Recent Files:" . "recent:")
                               ("Projects:" . "projects:")
                               ("Agenda for the coming week:" . "agenda:")))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; (setq dashboard-banner-logo-title (concat "GNU emacsへようこそ。今日は"
  ;;                                           (format-time-string "%m")
  ;;                                           "月"
  ;;                                           (format-time-string "%e")
  ;;                                           "日です"))
  (setq dashboard-banner-logo-title "GNU emacsへようこそ。")
#+END_SRC


#+BEGIN_SRC emacs-lisp
(if (or (display-graphic-p) (daemonp))
    (progn (setq dashboard-startup-banner (expand-file-name "hiten_render_rsz.png" user-emacs-directory)))
    (progn (setq dashboard-startup-banner (expand-file-name "gnu.txt" user-emacs-directory))))
#+END_SRC

** Evil-mode
Vi bindings are too deeply ingrained in my muscle memory to leave behind
#+BEGIN_SRC emacs-lisp
(use-package evil
  :init
  (setq evil-want-keybinding nil)
  :config
  (evil-mode 1)
  (use-package evil-leader
		:config
		(global-evil-leader-mode t)
		(evil-leader/set-leader "<SPC>"))
  
  (use-package evil-surround
    :config (global-evil-surround-mode))

  (use-package evil-indent-textobject))
#+END_SRC

Add some extra vi integration to other programs
#+BEGIN_SRC emacs-lisp
(use-package evil-collection
  :config
  (evil-collection-init))
#+END_SRC
*** Vim-fold
Vim-style folding
#+BEGIN_SRC emacs-lisp
(straight-use-package 'vimish-fold)
(straight-use-package 'evil-vimish-fold)
#+END_SRC

** Company
The one true autocompleter
#+BEGIN_SRC emacs-lisp
(straight-use-package 'company)
(add-hook 'after-init-hook 'global-company-mode)
(straight-use-package 'company-ctags)
#+END_SRC

** Projectile
#+BEGIN_SRC emacs-lisp
(straight-use-package 'projectile)
(projectile-mode +1)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
#+END_SRC

** Searching
*** Selectrum
I currently use selectrum. I’m not sure yet if it’s actually better
than ivy or not, but I tried it out and I liked it.
#+BEGIN_SRC emacs-lisp
(straight-use-package 'selectrum)
(straight-use-package 'prescient)
(straight-use-package 'selectrum-prescient)
(selectrum-mode +1)
(selectrum-prescient-mode +1)
(prescient-persist-mode +1)
#+END_SRC

*** Marginalia
An essential addition to the search minibuffer that offers a bit of documentation.
#+BEGIN_SRC emacs-lisp
(straight-use-package 'marginalia)
(marginalia-mode)
#+END_SRC

** Japanese-related
#+BEGIN_SRC emacs-lisp
(straight-use-package 'anki-editor)
(straight-use-package 'sdcv)
(straight-use-package 'clipmon)
#+END_SRC
I use the migemo program to supplement incremental searching for Japanese. It
requires the cmigemo program in your path, and lets you search for japanese words
by typing in romaji.
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'migemo)
  (straight-use-package 'ivy-migemo)
  (require 'migemo)
  (setq migemo-command "cmigemo")
  (setq migemo-options '("-q" "--emacs"))
  (setq migemo-dictionary "/usr/share/migemo/utf-8/migemo-dict")
  (setq migemo-user-dictionary nil)
  (setq migemo-regex-dictionary nil)
  (setq migemo-coding-system 'utf-8-unix)
  (migemo-init)
#+END_SRC
*** Mecab
This requires mecab to be installed on your system, as well as a dictionary for it.
#+BEGIN_SRC emacs-lisp
  (straight-use-package '(mecab :type git
                                :repo "https://github.com/syohex/emacs-mecab"
                                :pre-build ("make")))

#+END_SRC
*** Reading books
Nov-mode is an excellent epub reader.
#+BEGIN_SRC emacs-lisp
(straight-use-package 'nov)
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
(setq nov-text-width 100)
#+END_SRC
** MPD
Mingus is a fairly hassle-free mpd client. It just works, and the keybinds
are actually surprisingly ergo.
#+BEGIN_SRC emacs-lisp
(straight-use-package 'libmpdee)
(straight-use-package 'mingus)
#+END_SRC

Make mingus redraw buffers when window size changes
#+BEGIN_SRC emacs-lisp
  (defun mingus-redraw-to-hook (FRAME)
    (mingus-redraw-all FRAME))

  (add-hook 'window-size-change-functions
            'mingus-redraw-to-hook)
#+END_SRC

** Highlights
*** Highlight todos
#+BEGIN_SRC emacs-lisp
(straight-use-package 'hl-todo)
(global-hl-todo-mode)
#+END_SRC

*** Highlight indent guides
#+BEGIN_SRC emacs-lisp
(straight-use-package 'highlight-indent-guides)
#+END_SRC

** Which-key
There are too many emacs keybindings and life is too short
#+BEGIN_SRC emacs-lisp
(straight-use-package 'which-key)
(which-key-mode)
#+END_SRC

** Format-all
All-purpose code formatter for when things break
#+BEGIN_SRC emacs-lisp
(straight-use-package 'format-all)
#+END_SRC

** VTerm
Undoubtedly the best terminal in emacs.
#+BEGIN_SRC emacs-lisp
(straight-use-package 'vterm)
#+END_SRC
*** Config
#+BEGIN_SRC emacs-lisp
(setq vterm-kill-buffer-on-exit t)
(setq vterm-buffer-name-string "vt//%s")
#+END_SRC
*** Keybindings
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<C-return>") 'vterm-toggle-cd)
(global-set-key (kbd "<C-S-return>") 'vterm-toggle)
#+END_SRC
*** Vterm-toggle
toggle a window with a re-usable vterm
#+BEGIN_SRC emacs-lisp
(straight-use-package 'vterm-toggle)
(setq vterm-toggle-hide-method 'delete-window)
(setq vterm-toggle-fullscreen-p nil)
#+END_SRC
#+BEGIN_SRC emacs-lisp
(setq vterm-toggle-fullscreen-p nil)
(add-to-list 'display-buffer-alist
             '((lambda(bufname _) (with-current-buffer bufname (equal major-mode 'vterm-mode)))
                (display-buffer-reuse-window display-buffer-at-bottom)
                (dedicated . t) ;dedicated is supported in emacs27
                (reusable-frames . visible)
                (window-height . 0.3)))
#+END_SRC

*** Kill vterm buffer and window
#+BEGIN_SRC emacs-lisp
  (defun vterm--kill-vterm-buffer-and-window (process event)
    "Kill buffer and window on vterm process termination."
    (when (not (process-live-p process))
      (let ((buf (process-buffer process)))
        (when (buffer-live-p buf)
          (with-current-buffer buf
            (kill-buffer)
            (ignore-errors (delete-window))
            (message "VTerm closed."))))))
(add-hook 'vterm-mode-hook
          (lambda ()
            (set-process-sentinel (get-buffer-process (buffer-name))
                                  #'vterm--kill-vterm-buffer-and-window)))
#+END_SRC
** Org-mode
Path configuration. I use a directory called org in my home directory to store
my org files.
#+BEGIN_SRC emacs-lisp
    (setq org-directory "~/org/")
    (setq org-agenda-files '("~/org/"))
    (setq org-hide-emphasis-markers t)
    (setq org-startup-with-latex-preview t)
    (evil-leader/set-key "o" 'org-agenda)
    (add-hook 'org-mode-hook (lambda ()
                   ;;(org-superstar-mode 1)
                   (org-indent-mode 1)
                   (org-fragtog-mode 1)
                   (setq electric-quote-mode 'nil)))
#+END_SRC

Even emacs can’t make me not procrastinate!
#+BEGIN_SRC emacs-lisp
(setq org-deadline-warning-days 2)
#+END_SRC


*** Org-fragtog
A neat little package to render latex fragments as you write them.
#+BEGIN_SRC emacs-lisp
(straight-use-package 'org-fragtog)
#+END_SRC

** IRC
I store this outside of vc because it has some secrets.
#+BEGIN_SRC emacs-lisp
  (when (file-exists-p "ircconfig.elc")
    (load (expand-file-name "ircconfig" user-emacs-directory)))
#+END_SRC
** YASnippet
#+BEGIN_SRC emacs-lisp
(straight-use-package 'yasnippet)
(yas-global-mode)
(setq yas-indent-line 'fixed)
#+END_SRC

** Dired+
#+BEGIN_SRC emacs-lisp
    (straight-use-package 'dired+)
  (diredp-toggle-find-file-reuse-dir 1)
#+END_SRC
** AUR
Aur helper in emacs
#+BEGIN_SRC emacs-lisp
(straight-use-package 'aurel)
(setq aurel-info-download-function 'aurel-download-unpack-pkgbuild)
(setq aurel-list-download-function 'aurel-download-unpack-pkgbuild)
#+END_SRC

* Programming
** Config
*** Parentheses
I use electric to auto-complete paren and quote pairs
#+BEGIN_SRC emacs-lisp
(setq electric-pair-pairs '(
                           (?\{ . ?\})
                           (?\( . ?\))
                           (?\[ . ?\])
                           (?\" . ?\")
                           ))
(electric-pair-mode)
(electric-quote-mode)
#+END_SRC

*** Spaces over tabs
I don’t like tabs
#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
#+END_SRC
*** Final newline
#+BEGIN_SRC emacs-lisp
(setq mode-require-final-newline nil)
#+END_SRC

** Essential packages
*** Flycheck
Classic linter framework
#+BEGIN_SRC emacs-lisp
(straight-use-package 'flycheck)
#+END_SRC

*** Magit
Nothing to be said here
#+BEGIN_SRC emacs-lisp
(straight-use-package 'magit)
#+END_SRC

*** LSP
#+BEGIN_SRC emacs-lisp
(straight-use-package 'company-lsp)
(straight-use-package 'lsp-mode)
(straight-use-package 'lsp-ui)
#+END_SRC
**** Declutter lsp UI
#+BEGIN_SRC emacs-lisp
(setq lsp-ui-doc-show-with-mouse nil)
(setq lsp-ui-sideline-enable nil)
(setq lsp-modeline-code-actions-enable 1)
#+END_SRC



**** Code action keybinding
#+BEGIN_SRC emacs-lisp
(add-hook 'lsp-mode-hook (lambda ()
			   (local-set-key (kbd "C-c C-j") 'lsp-execute-code-action)))
#+END_SRC

